app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."open" = $1 LIMIT 4 OFFSET 0  [["open", "t"]]
---
  def list
    #-------QiaoCode--------
    @courses = Course.where(:open=>true).paginate(page: params[:page], per_page: 4)

SELECT  "courses".* FROM "courses" WHERE "courses"."teacher_id" = $1 LIMIT 4 OFFSET 0  [["teacher_id", 2]]
SELECT  "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1 LIMIT 4 OFFSET 0  [["user_id", 36]]
---
  def index
    @course=current_user.teaching_courses.paginate(page: params[:page], per_page: 4) if teacher_logged_in?
    @course=current_user.courses.paginate(page: params[:page], per_page: 4) if student_logged_in?