app/controllers/courses_controller.rb

  def open
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def statistic
    @course=current_user.courses.paginate(page: params[:page], per_page: 10)
    @grade = current_user.grades.paginate(page: params[:page], per_page: 10)
---
SELECT  "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 36]]
SELECT COUNT(*) FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
SELECT  "grades".* FROM "grades" WHERE "grades"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 36]]

  def timetable
    @course=current_user.courses.paginate(page: params[:page], per_page: 10)
---
SELECT  "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 36]]
SELECT COUNT(*) FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def list
    #-------QiaoCode--------
    @courses = Course.where(:open=>true).paginate(page: params[:page], per_page: 10)
    @course = @courses-current_user.courses
    tmp=[]
    @course.each do |course|
---
SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def select
    @courses=current_user.courses.paginate(page: params[:page], per_page: 10)
    @course = Course.find_by_id(params[:id])
    # @course = Course.find(:all, :select => 'id')
    tmp = 0
    @courses.each do |course|
      if (course == @course)
        tmp = 1
        flash={:warning => "您已选过该课程: #{@course.name}"}
        return redirect_to list_courses_path, flash: flash
      end

      if ((course.course_time[0..1] == @course.course_time[0..1]) && ((@course.course_time[3] >= course.course_time[3])&&(@course.course_time[3] <= course.course_time[5]) || (@course.course_time[5] >= course.course_time[3])&&(@course.course_time[5] <= course.course_time[5])))
        tmp = 1
        flash={:warning => "与已选课程：#{course.name}   时间冲突:)"}
        return redirect_to list_courses_path, flash: flash
      end

    end

        if (@course.limit_num != '' && (@course.limit_num == @course.student_num))
          tmp = 1
          flash={:warning => "#{@course.name}课程人数已达上限:)"}
          return redirect_to list_courses_path, flash: flash
        end

      if (tmp == 0)
        current_user.courses<<@course
        tmp2 = @course.student_num + 1
        @course.update_attributes(:student_num => tmp2)
---
SELECT  "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 36]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 35]]
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 1], ["updated_at", "2018-12-23 11:06:24.646923"], ["id", 38]]

  def quit
    @course=Course.find_by_id(params[:id])
    current_user.courses.delete(@course)
    if @course.student_num > 0
      tmp3 = @course.student_num - 1
      @course.update_attributes(:student_num => tmp3)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 0], ["updated_at", "2018-12-23 11:09:59.249780"], ["id", 34]]

  def index
    @course=current_user.teaching_courses.paginate(page: params[:page], per_page: 10) if teacher_logged_in?
    @course=current_user.courses.paginate(page: params[:page], per_page: 10) if student_logged_in?
---
SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = $1  [["teacher_id", 2]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."teacher_id" = $1  [["teacher_id", 2]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
SELECT COUNT(*) FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]